/*
 *  sinwave.c
 *  megaclock
 *
 *  Created by â∫âí ê^àÍ on 10/05/29.
 *  Copyright 2010 ã„èBçHã∆ëÂäwèÓïÒçHäwïî. All rights reserved.
 *
 */
#include "wiring.h"
#include "sinwave.h"

prog_uchar sin8[] = {0, 7, 13, 20, 27, 33, 40, 46, 53, 60, 66, 72, 79, 85, 91, 98, 104, \
	110, 116, 122, 128, 133, 139, 144, 150, 155, 160, 166, 171, 176, 180, \
	185, 190, 194, 198, 202, 206, 210, 214, 217, 221, 224, 227, 230, 233, \
	236, 238, 240, 243, 244, 246, 248, 249, 251, 252, 253, 254, 254, 255, \
	255, 255, 255, 255, 254, 254, 253, 252, 251, 249, 248, 246, 244, 243, \
	240, 238, 236, 233, 230, 227, 224, 221, 217, 214, 210, 206, 202, 198, \
	194, 190, 185, 180, 176, 171, 166, 160, 155, 150, 144, 139, 133, 128, \
	122, 116, 110, 104, 98, 91, 85, 79, 72, 66, 60, 53, 46, 40, 33, 27, \
	20, 13, 7};

int sinwave8(word n) {
	n %= 2*sizeof(sin8);
	if ( n < sizeof(sin8))
		return pgm_read_byte_near(sin8 + n);
	return -pgm_read_byte_near(sin8 + n - sizeof(sin8));
}

word periodwave8() {
	return 2*sizeof(sin8);
}
